cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияПлощадей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыПлощадей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадьМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтопливаемаяПлощадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поливная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадьНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьМОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьУчастка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьНадворныхПостроек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьДляСодержанияСельхозЖивотных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргТипыСтроений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыСтроений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖД_БлокЗастройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОБЩ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гараж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда		
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Неопределено);
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Район"		, Неопределено);
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
		
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Неопределено);
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Район"			, Неопределено);
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
		
		ДокументыМКД.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли; 
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Абоненты,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлощадиМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(УслугиМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПриборыМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказанияПУМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НежилыеПомещенияМКД,"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеПУТУМКД,	"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Помещения,			"Строение",	Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НачисленияМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,		"ОбъемУслугиПотребленный", 0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКДОстаток,		"МКД",		Элементы.Список.ТекущаяСтрока);
	
	ЗначенияРеквизитов = новый Соответствие;
	ЗначенияРеквизитов.Вставить("Организация","");
	ЗначенияРеквизитов.Вставить("Район",""); 
	ЗначенияРеквизитов.Вставить("ТипСтроения",""); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, Элементы.Список.ТекущаяСтрока, ЗначенияРеквизитов);
	
	ОтрицательныйОбъемРаспределенияМКДОстаток.Параметры.УстановитьЗначениеПараметра("ТекДата"			, ТекущаяДата());

	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, ЗначенияРеквизитов.Получить("Организация"));
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Район"			, ЗначенияРеквизитов.Получить("Район"));
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, ЗначенияРеквизитов.Получить("Организация"));
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Район"			, ЗначенияРеквизитов.Получить("Район"));
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	ДокументыМКД.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	УстановитьВидимостьВкладкаНачисления(ЗначенияРеквизитов.Получить("ТипСтроения"));
	
КонецПроцедуры 

#КонецОбласти

#Область СобытияТаблицыФормыПомещения

&НаКлиенте
Процедура ПомещенияПриАктивизацииСтроки(Элемент)
	
	 ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	 Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	 КонецЕсли;
	 
	 УстановитьДоступностьКомандТаблицыФормыПомещения(ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПомещенияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаСписка Из Строки Цикл
		Прервать;					
	КонецЦикла;
	ЕстьСвойствоПлощадь = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаСписка.Значение.Данные, "Площадь");
	Если НЕ ЕстьСвойствоПлощадь Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Район", Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	ТаблицаДанных.Колонки.Добавить("КлючПомещения", Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	
	ПоляЗаполнения = "Организация,Район,КлючПомещения";
	Для каждого СтрокаСписка Из Строки Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Ключ = СтрокаСписка.Ключ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСписка.Значение.Данные);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Ключ КАК Ключ,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Район КАК Район,
		|	ТаблицаДанных.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ СтрокиПоиска
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь
		|ПОМЕСТИТЬ АктуальныеЗначенияПлощадей
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			,
		|			(Организация, Район, КлючПомещения) В
		|					(ВЫБРАТЬ
		|						СтрокиПоиска.Организация КАК Организация,
		|						СтрокиПоиска.Район КАК Район,
		|						СтрокиПоиска.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						СтрокиПоиска КАК СтрокиПоиска)
		|				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)) КАК энргЗначенияПлощадейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиПоиска.Ключ КАК Ключ,
		|	АктуальныеЗначенияПлощадей.Площадь КАК Площадь
		|ИЗ
		|	СтрокиПоиска КАК СтрокиПоиска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеЗначенияПлощадей КАК АктуальныеЗначенияПлощадей
		|		ПО СтрокиПоиска.КлючПомещения = АктуальныеЗначенияПлощадей.КлючПомещения";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	ПоляЗаполнения = "Площадь";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 	
	Пока Выборка.Следующий() Цикл
		
		Для каждого СтрокаСписка Из Строки Цикл
			Если НЕ Выборка.Ключ = СтрокаСписка.Ключ Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаСписка.Значение.Данные, Выборка, ПоляЗаполнения);					
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СоздатьПомещение(Команда)
	ТекущиеДанные  = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Строение", ТекущиеДанные.Ссылка));
	ОткрытьФорму("Справочник.энргПомещения.ФормаОбъекта", ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияСЛицевымСчетомОткрытьФорму(Команда)
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("КлючПомещения", ТекущиеДанные.КлючПомещения));
	ОткрытьФорму("Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаОткрытиеЛС", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеДоговораОткрытьФорму(Команда)
	ОткрытьФорму("Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Форма.ФормаДокументаОткрытиеДоговора");
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеОткрытьФормуЭлемента(Команда)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	ПараметрыОткрытия  = Новый Структура("Ключ", ТекущиеДанные.Помещение);
	ОткрытьФорму("Справочник.энргПомещения.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПометитьНаУдаление(Команда)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	
	УстановитьПометкуУдаленияПомещенияСервер(ТекущиеДанные.Помещение, НЕ ТекущиеДанные.ПометкаУдаления);
	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьКомандТаблицыФормыПомещения(ТекущиеДанные) 
	
	яДоступность  				= НЕ ЗначениеЗаполнено(ТекущиеДанные.Абонент);
	ПодчиненныеЭлементыКП 		= Элементы.Помещения.КоманднаяПанель.ПодчиненныеЭлементы;
	ПодчиненныеЭлементыГруппа 	= ПодчиненныеЭлементыКП.ПомещенияГруппаСоздать;
	
	КомандаФормы 				= ПодчиненныеЭлементыГруппа.ПодчиненныеЭлементы.ПомещенияЗаключениеДоговораОткрытьФорму;
	КомандаФормы.Доступность 	= яДоступность;
	
	КомандаФормы 				= ПодчиненныеЭлементыГруппа.ПодчиненныеЭлементы.ПомещенияОткрытьЛицевойСчет;
	КомандаФормы.Доступность 	= яДоступность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаленияПомещенияСервер(ПомещениеСсылка, ПометкаУдаления)
	
	ПомещениеОбъект  = ПомещениеСсылка.ПолучитьОбъект();
	ПомещениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВкладкаНачисления(ТипСтроения)
	
	Если ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") 
		Или ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОБЩ") Тогда
		Видимость = Истина;
	Иначе
		Видимость = Ложь;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНачисленияМКД", "Видимость", Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыМКДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийРегистратор = Элементы.ДокументыМКД.ТекущиеДанные.Регистратор;
	
	ПараметрыОткрытияФормы = Новый Структура("Ключ", ТекущийРегистратор);
	
	Если ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргОткрытиеМКД")  Тогда
		ВидОперации = ПолучитьВидОперацииДокумента(ТекущийРегистратор);
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОткрытиеМКД_Закрытие") тогда
			Форма = ПолучитьФорму("Документ.энргОткрытиеМКД.Форма.ФормаДокументаЗакрытиеМКД",ПараметрыОткрытияФормы);
		Иначе  		
			Форма = ПолучитьФорму("Документ.энргОткрытиеМКД.Форма.ФормаДокументаОткрытиеМКД",ПараметрыОткрытияФормы);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргРегистрацияАварийностиСтроения") Тогда
		Форма = ПолучитьФорму("Документ.энргРегистрацияАварийностиСтроения.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргСоглашениеОРаспределенииСверхнормативногоОДН") Тогда
		Форма = ПолучитьФорму("Документ.энргСоглашениеОРаспределенииСверхнормативногоОДН.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргУстановитьПроцентРаспределенияОтрицательногоОДН") Тогда
		Форма = ПолучитьФорму("Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	КонецЕсли;
	
	Форма.открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперацииДокумента(ДокументРегистратор)

   Возврат ДокументРегистратор.ВидОперации;

КонецФункции 

#КонецОбласти
